app/Http/Controllers/DashboardController.php

    public function index()
{
    // Today's visitors count
    $todayCount = Visitors::whereDate('created_at', now()->toDateString())->count();  // Adjusted based on created_at

    // Last 7 days visitors count
    $last7Days = Visitors::whereBetween('created_at', [now()->subDays(7), now()])->count();  // Adjusted based on created_at

    // Last month's visitors count
    $lastMonth = Visitors::whereMonth('created_at', now()->subMonth()->month)->count();  // Adjusted based on created_at

    // Total visitors count
    $totalVisitors = Visitors::count();  // Count all visitors
---
select count(*) as aggregate from `visitors` where date(`created_at`) = '2025-02-17'
select count(*) as aggregate from `visitors` where `created_at` between '2025-02-10 11:38:37' and '2025-02-17 11:38:37'
select count(*) as aggregate from `visitors` where month(`created_at`) = '01'
select count(*) as aggregate from `visitors`