app/Http/Controllers/EnquiryController.php

select count(*) as aggregate from `enquiries` where (`name` LIKE '%amena%' or `email` LIKE '%amena%' or `phone` LIKE '%amena%')
---
    public function submitform(Request $request){

        // Validate the incoming data
    $validatedData = Validator::make($request->all(),[
        'name' => 'required|max:255',
        'email' => 'required|email',
        'gender'    => 'required|string|in:male,female,other',
        'phone'     => 'required|numeric|digits_between:7,15',
        'country' => 'required||string',
        'state' => 'nullable|string',
        'isnri'     => 'required',
        'program' => 'required',
        'course' => 'required',
        'agreement' => 'required|in:1',
    ]);
    if ($validatedData->fails()) {
        toastr()->error($validatedData->errors()->first());
        return redirect()
            ->back()
            ->withErrors($validatedData->errors())
            ->withInput();
    };
    Enquiries::create([
        'name' => $request->name,
        'email' => $request->email,
        'gender' => $request->gender,
        'phone' => $request->phone,
        'country' => $request->country,
        'state' => $request->state,
        'is_nri' => $request->isnri,
        'program' => $request->program,
        'course' => $request->course,
    ]);