app/Http/Controllers/EnquiryController.php

select * from `courses` where `program_id` = '2'
---
    public function fetchCourses()
    {
        $program_id = request()->get('program_id');
        $validator = Validator::make(['program_id' => $program_id], [
            'program_id' => 'required|numeric|exists:programs,id'
        ]);
        if ($validator->fails()) {
            return response()->json(['error' => 'Invalid Program']);
        }
        $courses = Course::where('program_id', $program_id)->get();

select * from `enquiries` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `enquiries`
---
    public function index(Request $request)
    {
        // Start the query
        $enquiries = Enquiries::query();

        // Apply the search condition if a search term is present
        if ($request->has('search')) {
            $search = $request->input('search');

            $enquiries->where(function ($query) use ($search) {
                $query->where('name', 'LIKE', "%{$search}%")
                    ->orWhere('email', 'LIKE', "%{$search}%")
                    ->orWhere('phone', 'LIKE', "%{$search}%");
            });
        }

        // Paginate the results (10 per page)
        $enquiries = $enquiries->paginate(10);

insert into `enquiries` (`name`, `email`, `gender`, `phone`, `country`, `state`, `is_nri`, `program_id`, `course_id`, `updated_at`, `created_at`) values ('Thor Vinson', 'hazixemali@mailinator.com', 'female', '18083548712', 'New Zealand', null, '0', '1', '2', '2025-02-17 17:31:00', '2025-02-17 17:31:00')
---
    public function submitform(Request $request)
    {
        // Validate the incoming data
        $validatedData = Validator::make($request->all(), [
            'name' => 'required|max:255',
            'email' => 'required|email',
            'gender' => 'required|string|in:male,female,other',
            'phone' => 'required|numeric|digits_between:7,15',
            'country' => 'required||string',
            'state' => 'nullable|string',
            'isnri' => 'required|boolean',
            'program' => 'required|exists:programs,id',
            'course' => 'required|exists:courses,id',
            'agreement' => 'required|in:1',
        ]);
        if ($validatedData->fails()) {
            Alert::error('Registration failed');
            return redirect()
                ->back()
                ->withErrors($validatedData->errors())
                ->withInput();
        };
        Enquiries::create([
            'name' => $request->name,
            'email' => $request->email,
            'gender' => $request->gender,
            'phone' => $request->phone,
            'country' => $request->country,
            'state' => $request->state,
            'is_nri' => $request->isnri,
            'program_id' => $request->program,
            'course_id' => $request->course,
        ]);