app/Http/Controllers/FormController.php

    public function showForm()
    {
        $categories = VisitorCategory::all();
---
select * from `visitorcategory`

    public function submitForm(Request $request)
    {
        // Validate the incoming data
        $validatedData = Validator::make($request->all(), [
            'name' => 'required|max:255',
            'email' => 'required|email',
            'phoneNumber' => 'required|max:15',
            'reasonForVisit' => 'required',
            'description' => 'nullable',
            'other' => 'nullable',  // Optional if "other" is selected
        ]);
        if ($validatedData->fails()) {
            return redirect()
                ->back()
                ->withErrors($validatedData)
                ->withInput();
        }
        // Check if the visitor already exists
        $visitor = Visitors::firstOrCreate(
            ['email' => $request->email],
            ['name' => $request->name, 'phone' => $request->phoneNumber]
        );

        // Create a new visit record
        $visit = Visits::create([
            'visitor_id' => $visitor->id,
            'category' => $request->reasonForVisit,
            'other_category' => $request->other,
            'description' => $request->description,
            'arrived_at' => now(),
            'exited_at' => null,
        ]);
        // Fetch category name from VisitorCategory table using the provided category ID
        $categoryname = VisitorCategory::find($request->reasonForVisit)->category ?? 'NULL';
---
insert into `visitors` (`email`, `name`, `phone`, `updated_at`, `created_at`) values ('carymox@mailinator.com', 'Simone Paul', '16192165544', '2025-02-18 00:12:36', '2025-02-18 00:12:36')
select * from `visitors` where `email` = 'buzum@mailinator.com' limit 1
insert into `visits` (`visitor_id`, `category`, `other_category`, `description`, `arrived_at`, `exited_at`, `updated_at`, `created_at`) values (1, '4', null, 'Fugiat minus porro p', '2025-02-18 00:12:36', null, '2025-02-18 00:12:36', '2025-02-18 00:12:36')
select `category` from `visitorcategory` where `id` = '2'