app/Http/Controllers/VisitorsController.php

    public function show($id){
        $visitor=DB::table('visitors')
        ->where('visitor_id',$id)
        ->select('name','email','phone','created_at')
        ->get();
        $queries = DB::table('visitors')
        ->join('visits', 'visitors.visitor_id', '=', 'visits.visitor_id')
        ->where('visitors.visitor_id', $id)  // Ensure it fetches data for the selected visitor
        ->select(
            'visits.category',
            'visits.other_category',
            'visits.arrived_at',
            'visits.description'
        )->paginate(10);
---
select `name`, `email`, `phone`, `created_at` from `visitors` where `visitor_id` = '16' limit 1
select `visitors`.`visitor_id`, `visitors`.`name`, `visitors`.`email`, `visitors`.`phone`, COUNT(visits.visitor_id) as visit_count from `visitors` left join `visits` on `visitors`.`visitor_id` = `visits`.`visitor_id` group by `visitors`.`visitor_id`, `visitors`.`name`, `visitors`.`email`, `visitors`.`phone` order by `visitors`.`created_at` desc limit 10 offset 0
select `visits`.`id`, `visitorcategory`.`category` as `category`, `visits`.`other_category`, `visits`.`arrived_at`, `visits`.`description` from `visits` inner join `visitorcategory` on `visits`.`category` = `visitorcategory`.`id` where `visits`.`visitor_id` = '16' limit 10 offset 0
select count(*) as aggregate from `visits` inner join `visitorcategory` on `visits`.`category` = `visitorcategory`.`id` where `visits`.`visitor_id` = '16'