app/Http/Controllers/VisitorsController.php

select `visits`.`id`, `visitorcategory`.`category` as `category_name`, `visits`.`other_category`, `visits`.`arrived_at`, `visits`.`description` from `visits` inner join `visitorcategory` on `visits`.`category` = `visitorcategory`.`id` where `visits`.`visitor_id` = '16' limit 10 offset 0
---
    public function show($id)
    {
        $visitor = DB::table('visitors')
            ->select('name', 'email', 'phone', 'created_at')
            ->where('visitor_id', $id)
            ->first();  // Fetch the visitor record

        $queries = DB::table('visits')
            ->join('visitorcategory', 'visits.category', '=', 'visitorcategory.id')  // Join with the categories table
            ->select('visits.id', 'visitorcategory.category as category_name', 'visits.other_category', 'visits.arrived_at', 'visits.description')
            ->where('visits.visitor_id', $id) // Filter visits by visitor_id
            ->paginate(10);